In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('./titanic_ds.csv')

In [7]:
df.groupby(['Sex','Age']).agg(Overal = ('Survived','count'), Survived = ('Survived','sum')).reset_index()

        Sex    Age  Overal  Survived
0    female   0.75       2         2
1    female   1.00       2         2
2    female   2.00       6         2
3    female   3.00       2         1
4    female   4.00       5         5
..      ...    ...     ...       ...
140    male  70.00       2         0
141    male  70.50       1         0
142    male  71.00       2         0
143    male  74.00       1         0
144    male  80.00       1         1

[145 rows x 4 columns]

In [29]:

cut_labels = [5,15,25,35,45,55,65,75,85]
cut_bins = [0,10,20,30,40,50,60,70,80,float('inf')]

In [32]:
df['Age_bin'] = pd.cut(df['Age'] ,  bins = cut_bins, labels =  cut_labels )

In [33]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,bin,Age_bin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,25,25
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,35,35
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,25,25
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35,35
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,35,35
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,25,25
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,15,15
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,25,25
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,35,35

In [37]:
df2 = df.groupby(['Sex','Age_bin']).agg(Overal = ('Survived','count'), Survived = ('Survived','sum')).reset_index()

In [38]:
df2['survive_percent'] = df2['Survived'].divide(df2['Overal'])

In [40]:
df2.pivot( columns = 'Sex', index = 'Age_bin', values = 'survive_percent')

Sex        female      male
Age_bin
5        0.612903  0.575758
15       0.739130  0.144928
25       0.753086  0.154362
35       0.836364  0.230000
45       0.677419  0.218182
55       0.928571  0.142857
65       1.000000  0.071429
75            NaN  0.200000
85            NaN       NaN